print("ตรวจสอบเกรด")
a = int (input('โปรดใส่คะแนนของคุณ'))
if a < 0 or > 100 :
    print ('กรุณากรอก 0 - 100')
elif a >= 80 :
    print ('คุณได้เกรด 4 ')
elif a >= 70 :
    print ('คุณได้เกรด 3')
elif a >= 60 :
    print ('คุณได้เกรด 2')
elif a >= 50 :
    print ('คุณได้เกรด 1')
else
    print('คุณได้เกรด 0')    
    print('ต้องการแก้ หรือ ไม่แก้ ถ้าต้องการพิมพ์ 1 ไม่ต้องการพิมพ์ 2 ')
   if b ==1:
    a = 50 - a
    print('คุณขาดคะแนนอีก{a}')
   elif b == 2:
    print('สอบตกเหมือนเดิม')
    e;se
